# -*- coding: utf-8 -*-
#+STARTUP: overview indent inlineimages logdrawer
#+TITLE:       Bib4ra: biblio splitting for CVs and activity reports
#+AUTHOR:      Arnaud Legrand

This perl script allows to split a BibTeX bibliography per type and
year and to build a small summary, which can be quite useful for
activity reports or CVs. [[file:publis.pdf][Here is what it looks like]]. It's a bunch of
hack but once you have set it up, all this goes directly in your
report without any manual intervention.

#+BEGIN_CENTER
_FEEL FREE TO FORK AND IMPROVE :)_
#+END_CENTER

*Usage:* Clone the repository to have all files, then read the
information below, adapt to your needs and give it a try.

*Note*: this is not really a documentation and is quite ugly. Actually,
the whole source code is in this file (I use org-mode's tangling
mechanism) and all the rest of the files you can find in this git are
automatically generated files. This set of perl scripts heavily
depends on the [[https://packages.debian.org/sid/libtext-bibtex-perl][Text::BibTeX perl package]] and on [[https://packages.debian.org/sid/tex/texlive-bibtex-extra][the bibtopic LaTeX
package]].

*History*: I've been writing such kind of things several times in shell
using [[https://packages.debian.org/sid/tex/libtext-bibtex-perl][bibtool]], then in ruby within [[http://pistou.imag.fr/][pistou]] whose support is now
discontinued, in perl/org-mode for the SimGrid website and ideally all
of this will one day end up in HAL but I'm too lazy/busy to enter the
php madness of HAL. Anyway, I finally realized after digging into this
once more that simply sharing it could save time to others.

*** How does it work?
From =mescal.bib=, I generate the following bib files:
#+begin_src sh :results output org raw :exports results
ls *-*.bib | sed 's/^/- /'
#+end_src

#+RESULTS:
- article-2013.bib
- article-2014.bib
- article-2015.bib
- article-2016.bib
- inproceedings-2013.bib
- inproceedings-2014.bib
- inproceedings-2015.bib
- others-2013.bib
- others-2014.bib
- others-2015.bib
- phdthesis-2013.bib
- phdthesis-2015.bib
- techreport-2013.bib
- techreport-2014.bib
- techreport-2015.bib
- techreport-2016.bib

I also generate a [[Text::BibTeX perl package][tex file]] (=liste_publications.tex=) that builds on
bibtopic and creates a section to include each of the previous bib
files. This file is included by [[file:publis.tex][publis.tex]]. All I have to do then is
to:
1. compile =publis.tex= with pdflatex
2. call bibtex on all the resulting .aux files
3. compile =publis.tex= with pdflatex a few more times
** Bibtable "by type"
The =bibtable_bytype= can be used either to produce a table sorted by
type and year. It can be used:

- as on the [[http://simgrid.gforge.inria.fr/Usages.php][SimGrid website]] (in which case I generate an org table)
  #+begin_src perl :results output org raw :exports both
    use Text::BibTeX;
    require "bibtex.pl";

    $biblio = "mescal.bib";

    my $bibfile = new Text::BibTeX::File($biblio);
    bibtable_bytype($bibfile,"org");
  #+end_src

  #+RESULTS:
  |----------------------------------------------+------+------+------+------+-------|
  | Year                                         | 2013 | 2014 | 2015 | 2016 | Total |
  |----------------------------------------------+------+------+------+------+-------|
  | Journal articles                             |    7 |   10 |   16 |    2 |    35 |
  | Conference articles                          |   20 |   20 |   10 |      |    50 |
  | Accreditation to Supervise Research (H.D.R.) |      |      |    1 |      |     1 |
  | PhD thesis                                   |    1 |      |      |      |     1 |
  | Technical reports                            |   12 |    6 |    3 |    1 |    22 |
  | Others                                       |    2 |    5 |    5 |      |    12 |
  |----------------------------------------------+------+------+------+------+-------|
  | Total                                        |   42 |   41 |   35 |    3 |   121 |
  |----------------------------------------------+------+------+------+------+-------|

- or as in activity reports (in which case I directly generate a [[file:liste_publications_table.tex][latex
  table]]).
  #+begin_src perl :results output :exports code :tangle bibtable.pl
    use Text::BibTeX;
    require "bibtex.pl";

    $biblio = "mescal.bib";

    my $bibfile = new Text::BibTeX::File($biblio);
    bibtable_bytype($bibfile,"latex");
  #+end_src

  #+RESULTS:
